## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           NAME                            |
|----------|-----------------------------------------------------------|
| update   | `module.rds_cluster.aws_security_group.rds_proxy`         |
| recreate | `aws_rds_cluster_parameter_group.enable_audit_logging`    |
| add      | `aws_rds_cluster_parameter_group.enable_audit_logging_v8` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_rds_cluster_parameter_group.enable_audit_logging must be replaced
-/+ resource "aws_rds_cluster_parameter_group" "enable_audit_logging" {
      ~ arn         = "arn:aws:rds:ca-central-1:729164266357:cluster-pg:wordpress-aurora-mysql57" -> (known after apply)
      ~ description = "RDS cluster parameter group with audit logging enabled" -> "RDS cluster parameter group with audit logging enabled for MySQL 5.7" # forces replacement
      ~ id          = "wordpress-aurora-mysql57" -> (known after apply)
        name        = "wordpress-aurora-mysql57"
      + name_prefix = (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      + parameter {
          + apply_method = "immediate"
          + name         = "binlog_format"
          + value        = "ROW"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_rds_cluster_parameter_group.enable_audit_logging_v8 will be created
  + resource "aws_rds_cluster_parameter_group" "enable_audit_logging_v8" {
      + arn         = (known after apply)
      + description = "RDS cluster parameter group with audit logging enabled for MySQL 8.0"
      + family      = "aurora-mysql8.0"
      + id          = (known after apply)
      + name        = "wordpress-aurora-mysql8"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "binlog_format"
          + value        = "ROW"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_events"
          + value        = "CONNECT,QUERY_DCL,QUERY_DDL,QUERY_DML"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_logging"
          + value        = "1"
        }
    }

  # module.rds_cluster.aws_security_group.rds_proxy will be updated in-place
  ~ resource "aws_security_group" "rds_proxy" {
        id                     = "sg-0ffeb4f8a74eeab1f"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 3306
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - description      = "Client VPN ingress to the database"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-098ae48afb5d878b3",
                ]
              - self             = false
              - to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 3306
            },
        ]
        name                   = "wordpress_rds_proxy_sg"
        tags                   = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging_v8"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_name"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_username"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
